Revit 2027 API
BuiltInFailures.AnalyticalAutomationFailures Class
 Failures about Analytical Automation.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.AnalyticalAutomationFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class AnalyticalAutomationFailures
Public NotInheritable Class AnalyticalAutomationFailures
public ref class AnalyticalAutomationFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type AnalyticalAutomationFailures = class end
The BuiltInFailures.AnalyticalAutomationFailures type exposes the following members.
Properties
Name | Description
DeleteGeneratedPlans |  You are about to change your selection. Updating your selection will delete the existing reference plans.
EmptySelection |  There are no selected elements.
LevelsHiddenInViewWarning |  Some levels are hidden. The alignment plans will also consider the hidden levels.
Top
See Also
Reference
Autodesk.Revit.DB Namespace